Revit 2026 API

# TemperatureRatingTypeAddInsulationType Method

---

Add a new kind of insulation type into this temperature rating type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InsulationType AddInsulationType(
	string name
)
```
```vb
Public Function AddInsulationType (
	name As String
) As InsulationType
```
```cpp
public:
InsulationType^ AddInsulationType(
	String^ name
)
```
```fsharp
member AddInsulationType :
        name : string -> InsulationType
```

#### Parameters

name String
    Name of insulation type symbol to be constructed and added.

#### Return Value

InsulationTypeConstructed insulation type instance.

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace